
- **products** - Items sold in the store
- **customers** - People who buy products
- **orders** - Records of purchases

In [2]:
import sqlite3
import pandas as pd

# Connect to database
conn = sqlite3.connect('store.db')

# Helper function to run SQL queries
def run_sql(query):
    return pd.read_sql_query(query, conn)

print("Connected to database!")

Connected to database!

Get the table

In [3]:
# View the products table
run_sql("SELECT * FROM products")

    product_id   product_name     category   price  stock_quantity
0            1         Laptop  Electronics  999.99              50
1            2     Smartphone  Electronics  699.99             100
2            3     Headphones  Electronics  149.99             200
3            4   Coffee Table    Furniture  249.99              30
4            5   Office Chair    Furniture  199.99              45
5            6      Bookshelf    Furniture  129.99              25
6            7  Running Shoes       Sports   89.99              80
7            8     Basketball       Sports   29.99              60
8            9       Yoga Mat       Sports   39.99             100
9           10   Water Bottle       Sports   19.99             150
10          11      Desk Lamp  Electronics   49.99              75
11          12   Gaming Mouse  Electronics   79.99              90

In [4]:
# View the customers table
run_sql("SELECT * FROM customers")

   customer_id first_name last_name                 email         city
0            1       John     Smith  john.smith@email.com     New York
1            2      Sarah   Johnson     sarah.j@email.com  Los Angeles
2            3       Mike  Williams      mike.w@email.com      Chicago
3            4      Emily     Brown     emily.b@email.com      Houston
4            5      David     Jones     david.j@email.com     New York
5            6       Lisa    Garcia      lisa.g@email.com  Los Angeles
6            7      James    Miller     james.m@email.com      Seattle
7            8       Anna     Davis      anna.d@email.com      Chicago

In [5]:
# View the orders table
run_sql("SELECT * FROM orders")

    order_id  customer_id  product_id  quantity  order_date
0          1            1           1         1  2024-01-15
1          2            1           3         2  2024-01-15
2          3            2           2         1  2024-01-16
3          4            3           5         1  2024-01-17
4          5            4           7         2  2024-01-18
5          6            5           1         1  2024-01-19
6          7            6           9         3  2024-01-20
7          8            7           4         1  2024-01-21
8          9            8          12         2  2024-01-22
9         10            1          10         4  2024-01-23
10        11            2           6         1  2024-01-24
11        12            3           8         2  2024-01-25
12        13            4          11         1  2024-01-26
13        14            5           3         1  2024-01-27
14        15            6           2         1  2024-01-28

## Problem 1: SELECT All
**Question:** Get all columns from the `products` table.

**Hint:** Use `SELECT * FROM table_name`

In [6]:
#Write your answer here:
run_sql("""

""")

TypeError: 'NoneType' object is not iterable

---
## Problem 2: SELECT Specific Columns
**Question:** Get only the `product_name` and `price` from the products table.

**Hint:** List column names separated by commas

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 3: WHERE Clause
**Question:** Find all products in the 'Electronics' category.

**Hint:** Use `WHERE column = 'value'`

In [ ]:
# Write your answer here:
run_sql("""

""")

---
## Problem 4: Comparison Operators
**Question:** Find all products with price greater than $100.

**Hint:** Use `WHERE price > 100`

In [ ]:
# Write your answer here:
run_sql("""

""")

---
## Problem 5: ORDER BY
**Question:** Get all products ordered by price from highest to lowest.

**Hint:** Use `ORDER BY column DESC`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 6: LIMIT
**Question:** Get the top 3 most expensive products.

**Hint:** Combine `ORDER BY` and `LIMIT`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 7: COUNT
**Question:** How many products are in each category?

**Hint:** Use `COUNT(*)` with `GROUP BY`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 8: AVG (Average)
**Question:** What is the average price of all products?

**Hint:** Use `AVG(column)`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 9: SUM
**Question:** What is the total stock quantity for all Electronics products?

**Hint:** Use `SUM(column)` with `WHERE`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 10: JOIN (Combining Tables)
**Question:** Show all orders with customer first_name, last_name, and product_name.

**Hint:** Use `JOIN table ON condition`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 11: AND / OR
**Question:** Find products that are in 'Electronics' category AND have a price less than $100.

**Hint:** Use `WHERE condition1 AND condition2`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 12: LIKE (Pattern Matching)
**Question:** Find all customers whose email contains 'email.com'.

**Hint:** Use `LIKE '%pattern%'` (% means any characters)

In [11]:
# Write your answer here:
run_sql("""
    SELECT *
    FROM customers
    WHERE email LIKE '%email.com%'
""")

   customer_id first_name last_name                 email         city
0            1       John     Smith  john.smith@email.com     New York
1            2      Sarah   Johnson     sarah.j@email.com  Los Angeles
2            3       Mike  Williams      mike.w@email.com      Chicago
3            4      Emily     Brown     emily.b@email.com      Houston
4            5      David     Jones     david.j@email.com     New York
5            6       Lisa    Garcia      lisa.g@email.com  Los Angeles
6            7      James    Miller     james.m@email.com      Seattle
7            8       Anna     Davis      anna.d@email.com      Chicago